---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.NumberSystemReferenceOffset
source: html/73f60bde-33db-d258-4f9c-c9a2848eaa37.htm
---
# Autodesk.Revit.DB.ParameterTypeId.NumberSystemReferenceOffset Property

"Offset from Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId NumberSystemReferenceOffset { get; }
```